#Область ПрограммныйИнтерфейс  

Процедура ДополнитьФорму(Форма) Экспорт  
	// Добавление на формы всех документов реквизита КонтактноеЛицо, 
	ИмяФормы = Форма.ИмяФормы; 
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
    ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

    // Реализация добавления на формы документов ЗаказПокупателя, ПоступленияТоваровИУслуг, РеализацияТоваровИУслуг
	// реквизита КонтактноеЛицо
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	ПолеВВода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВВода.ПутьКДанным = "Объект.АГ_КонтактноеЛицо";
КонецПроцедуры   

    // Реализация добавления на формы документов ОплатаОтПокупателя и ОплатаПоставщику реквизита КонтактноеЛицо 
Процедура ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) Экспорт
	ПолеВВода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВВода.ПутьКДанным = "Объект.АГ_КонтактноеЛицо";
КонецПроцедуры

#КонецОбласти
