#Область ПрограммныйИнтерфейс  

Процедура ДополнитьФорму(Форма) Экспорт  
	// Добавление на формы всех документов реквизита КонтактноеЛицо, 
	// а так же реквизита СогласованнаяСкидка и кнопки ПересчитатьТаблицу на форму документа ЗаказПокупателя
	ИмяФормы = Форма.ИмяФормы; 
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПравоСогласованнаяСкидка(Форма);	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПравоСогласованнаяСкидка(Форма) Экспорт  
	
	// Добавление на форму документа ЗаказПокупателя группы СкидкиПересчет
	ГруппаДатаНомер = Форма.Элементы.Добавить("СкидкаПересчет", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	ГруппаДатаНомер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатаНомер.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДатаНомер.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаДатаНомер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	// Добавление в созданную рпуппу реквизита СогласованнаяСкидка и установка действия ПриИзменении этого реквизита
	ПолеВВода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.СкидкаПересчет);
	ПолеВВода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВВода.ПутьКДанным = "Объект.АГ_СогласованнаяСкидка";  	
	Форма.Элементы.СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "АГ_СогласованнаяСкидкаПриИзменении");
	
	// Добавление в созданную рпуппу кнопки ПересчитатьТаблицу и установка действия этой кнопки
	НоваяКоманда = Форма.Команды.Добавить("АГ_ПересчитатьТаблицу");
	НоваяКоманда.Действие = "АГ_ПересчитатьТаблицу";
	НоваяКоманда.Заголовок = "Пересчитать Таблицу";
	
	Кнопка = Форма.Элементы.Добавить("АГ_ПересчитатьТаблицу", Тип("КнопкаФормы"),Форма.Элементы.СкидкаПересчет);
	Кнопка.ИмяКоманды = "АГ_ПересчитатьТаблицу"; 
КонецПроцедуры  

#КонецОбласти
